# 青蛙跳台阶1：
# 一只青蛙一次可以跳上1级台阶，也可以跳上2级。
# 求该青蛙跳上一个n级的台阶总共有多少种跳法（先后次序不同算不同的结果）。
# 斐波那契
######################################################################
def jumpFloor(number):
    if number == 1:
        return 1
    if number == 2:
        return 2
    number = number - 2
    pre = 1
    last = 2
    while number > 0:
        number = number - 1
        last = pre + last
        pre = last - pre
    return last
######################################################################
# 青蛙跳台阶2：
# 一只青蛙一次可以跳上1级台阶，也可以跳上2级……它也可以跳上n级。
# 求该青蛙跳上一个n级的台阶总共有多少种跳法。
# 2的指数幂
######################################################################
def jumpFloorII(number):
    #return 1<<(number-1)
    return 2**(number-1)

######################################################################